[
  {
    "title": "My Skills",
    "alias": "skills",
    "headline": "Full-stack Developer with expertise in MERN Stack, AI Integration, and Competitive Programming",
    "searchDescription": "Proficient in building scalable web applications, AI-powered solutions, and mobile applications using React, Next.js, Node.js, Express.js, Flask, and React Native with strong algorithmic problem-solving skills",
    "longDescription": "I'm a versatile full-stack developer with comprehensive expertise across modern web and mobile technologies. My frontend specialization includes crafting responsive, engaging interfaces using HTML5, CSS3, JavaScript, TypeScript, Tailwind CSS, React.js, and Next.js. On the backend, I architect robust and scalable solutions with Node.js, Express.js, Flask, MongoDB, and MySQL. I'm proficient in multiple programming languages including C, C++, Python, JavaScript, and TypeScript. My development toolkit includes VS Code, Git/GitHub, Postman, Docker, and CI/CD with GitHub Actions. What sets me apart is my strong foundation in competitive programming with 1800+ problems solved across platforms, including 950+ on LeetCode with a Knight rating of 2022 (top 2.3%), CodeChef 4-star rating of 1804, and Codeforces Specialist rating of 1448. I also have hands-on experience with AI technologies, RAG architecture, FastAPI, and mobile development with React Native."
  },
  {
    "title": "My Education",
    "alias": "education",
    "headline": "Computer Science Engineering Student at IIIT Vadodara - International Campus Diu",
    "searchDescription": "Pursuing B.Tech in Computer Science and Engineering at IIIT Vadodara - ICD with comprehensive coursework in DBMS, DSA, Computer Networks, Operating Systems, AI, and Object-Oriented Programming",
    "longDescription": "I am currently pursuing my Bachelor of Technology in Computer Science and Engineering from IIIT Vadodara - International Campus Diu (October 2022 - May 2026). My comprehensive coursework includes Database Management Systems (DBMS), Data Structures and Algorithms (DSA), Computer Networks, Operating Systems, Artificial Intelligence, Object-Oriented Programming and Design, providing me with a strong theoretical foundation that complements my practical development skills. This rigorous academic program has equipped me with deep understanding of computer science fundamentals, enabling me to build efficient, scalable, and well-architected software solutions."
  },
  {
    "title": "Professional Experience",
    "alias": "experience",
    "headline": "Software Development Engineer Intern with proven expertise in AI-powered solutions, full-stack development, and system optimization",
    "searchDescription": "Experienced in developing AI-powered applications, scalable backend systems, mobile applications, and automation tools with measurable impact on performance and user engagement",
    "longDescription": "I bring substantial professional experience through impactful internships in software development. Currently serving as a Software Development Engineer Intern at Nervesparks (March 2025 - August 2025), where I engineered an AI-powered Teaching Agent using RAG architecture and FastAPI, processing 1000+ page PDFs to generate educational content and boosting personalized learning by 65%. I spearheaded frontend architecture for an offline GPT-based React Native mobile application, achieving 40% improvement in user engagement, and architected a multilingual PDF translator with 95% layout accuracy supporting 30+ languages. Previously, as a Tech Intern at Connexa (June 2024 - August 2024), I constructed a global professional search tool using Next.js and Flask, processing 100+ queries per minute and enhancing search speed by 30% for a 1M+ professional database. I deployed AI-powered email automation systems generating 1,000+ personalized emails weekly with 25% improved response rates, and designed scalable backend infrastructure managing 2,000+ daily requests while collaborating with agile teams of 5-10 developers."
  },
  {
    "title": "About Me",
    "alias": "aboutme",
    "headline": "Passionate Software Developer, AI Enthusiast, and Competitive Programmer",
    "searchDescription": "Full-stack developer with expertise in AI-powered solutions, mobile applications, and web development, demonstrated through successful internships and competitive programming achievements",
    "longDescription": "Hi! I'm Saurabh, a passionate Computer Science Engineering student at IIIT Vadodara - International Campus Diu, currently in my Fourth year. My journey in technology spans across full-stack web development, AI-powered solutions, mobile application development, and competitive programming. I specialize in creating sophisticated digital experiences using modern technologies like React.js, Next.js, React Native, Node.js, Express.js, Flask, and various AI frameworks including RAG architecture and FastAPI. With over 1800+ algorithmic problems solved across multiple platforms and notable achievements including a LeetCode Knight rating (top 2.3%), CodeChef 4-star rating, and impressive contest rankings, I bring strong problem-solving skills to every project. My professional experience includes developing AI-powered teaching agents, multilingual translators, real-time chat applications, and scalable backend systems that have demonstrably improved user engagement and system performance. I'm passionate about leveraging cutting-edge technologies to build solutions that make a meaningful impact, whether it's enhancing personalized learning through AI or creating seamless communication platforms. Join me on this exciting journey as I continue to transform innovative ideas into reality through code."
  }
]